Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: གཞན་ཡང་ཕུང་པོ་ལྔ་རྣམས་ནི་སྡུག་བསྔལ་བ་སྟེ། གང་ཕུང་པོ་ལྔ་རྣམས་ཀྱི་སྡུག་བསྔལ་གྱི་མཚན་ཉིད་དེ་ནི་སྡུག་བསྔལ་ཞེས་བྱའོ། ། སྡུག་བསྔལ་གྱི་མཚན་ཉིད་ཀྱི་གང་སྟོང་པ་ཉིད་ཀྱི་མཚན་ཉིད་རྟོགས་པ་དེ་ནི་སྡུག་བསྔལ་འཕགས་པའི་བདེན་པ་ཞེས་བྱའོ། ། གང་ཕུང་པོ་ལྔ་རྣམས་ཀྱི་བག་ལ་ཉལ་རྒྱུ་སྲེད་པ་ལས་བྱུང་བའི་ལྟ་བ་དེ་ནི་ཀུན་འབྱུང་བའི་བདེན་པ་ཞེས་བྱའོ། ། གང་སྲེད་པའི་རྒྱུ་ལྟ་བ་དེ་ལ་ཡང་སྒྲོ་མི་འདོགས་མི་ལེན་མི་སྙེམས་པ་དེ་ནི་ཀུན་འབྱུང་བ་འཕགས་པའི་བདེན་པ་ཞེས་བྱའོ། ། གང་ཕུང་པོ་ལྔ་རྣམས་ཤིན་ཏུ་ཟད་པའི་ཕྱིར་འགོག་པ་སྔོན་གྱི་མཐར་མ་བྱུང་བ། ཕྱི་མའི་མཐར་མི་འཕོ་བ། ད་ལྟར་བྱུང་བར་མི་གནས་པ་དེ་ནི་འགོག་པ་འཕགས་པའི་བདེན་པ་ཞེས་བྱའོ། ། གང་ལམ་ལ་བརྟེན་ནས་ སྡུག་བསྔལ་ཤེས་པ་དང་། ཀུན་འབྱུང་བ་ཤེས་པ་དང་། འགོག་པ་ཤེས་པ་ལ་ཡང་རེག་པར་བྱེད་ལ། རྗེས་ལས་རྟོགས་པའི་ཤེས་པ་ཡང་ཐོབ་པར་བྱེད་པ་དེ་ནི་སྡུག་བསྔལ་འགོག་པར་འགྱུར་བའི་ལམ་འཕགས་པའི་བདེན་པ་ཞེས་བྱའོ། ། གང་བདེན་པ་ཤེས་པ་དེ་ལ་རྣམ་པར་རྟོག་པ་དང་། སེམས་ཅན་ཡོངས་སུ་བརྟག་པ་ལ་རྟོག་པར་བྱེད་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བདེན་པ་ལ་མཁས་པ་ཞེས་བྱའོ། །
en: “Moreover, the five skandhas are suffering. That which has the characteristic of suffering in relation to the five skandhas is what is known as suffering, and when one becomes aware that the character of suffering is the characteristic emptiness, that is what is known as the noble truth of suffering. The view that is concerned with the cause being craving latent in the five skandhas is what is known as the truth of origination, and not involving oneself in reifying, grasping at, or judging this view that it is caused by craving is what is known as the noble truth of origination. That there is cessation, a final elimination of the five skandhas implying a lack of previous origination, a lack of a later transference, and a lack of a present existence, is what is known as the noble truth of cessation. That path, which when followed brings one into contact with the knowledge of suffering, the knowledge of its origin, and the knowledge of its cessation and leads one to attain the knowledge that comes from these three kinds of knowledge, is what is known as the noble truth of the way to the cessation of suffering. Maintaining an investigative approach toward this knowledge of truth, while still taking sentient beings into consideration, is what is known as the bodhisatva’s skilled approach to truth.

source: གཞན་ཡང་ཚོར་བ་ཐམས་ཅད་སྡུག་བསྔལ་བ་སྟེ། དེ་ལ་ཚོར་བར་བྱ་བ་རྣམ་པར་འབྱེད་པ་དང་། བློས་རིག་པ་ཉིད་དེ་ནི་སྡུག་བསྔལ་འཕགས་པའི་བདེན་པ་ཞེས་བྱའོ། ། རྒྱུ་གང་གིས་ཀུན་འབྱུང་བར་ཤེས་པའི་རྒྱུ་དེ་ཇི་ལྟ་བ་ཡང་དག་པར་རབ་ཏུ་ཤེས་པ་དེ་ནི་ཀུན་འབྱུང་བ་འཕགས་པའི་བདེན་པ་ཞེས་བྱའོ། ། གང་ཚོར་བ་གཏོང་ཞིང་མ་ཚོར་བ་ཚོར་བར་བྱེད་པ་དང་། འགོག་པ་ལ་ཡང་སོ་སོར་རྟོག་ལ་ཚོར་བ་འགོག་པ་ཡང་མངོན་དུ་མི་བྱེད་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྡུག་བསྔལ་འགོག་པ་འཕགས་པའི་བདེན་པ་ཞེས་བྱའོ། ། ཚོར་བ་གང་གིས་གཟིངས་དང་འདྲ་བའི་ལམ་དེ་སྡུད་པར་བྱེད་ལ་ཚོར་བར་དགོས་པ་ཡང་མ་ཡིན། ལམ་གྱི་དགོས་པ་ཡང་མ་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་འཕགས་པའི་བདེན་པ་ཞེས་བྱའོ། ། དེ་ལྟར་རྟོགས་ནས་བདེན་པ་དེ་བཞི་ལ་མཉམ་པར་མཐོང་ཞིང་མཐོང་བ་ཤིན་ཏུ་དག་པའང་མ་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བདེན་པ་ལ་མཁས་པ་ཞེས་བྱའོ། །
en: “Moreover, all feelings are suffering, and to discern feelings and grasp them with the mind is what is known as the noble truth of suffering. In relation to the cause that gives rise to feelings, he understands that cause exactly as it is, and this is what is known as the noble truth of origination. The calming of feelings and the feeling of non-feeling, as well as discerning cessation while not reifying the cessation of feelings, is what is known as the bodhisatva’s noble truth of the cessation of suffering. Any feelings that function in such a way as to constitute a path, that are in that way like a raft, and that aim neither for feelings nor for a path are what are known as the bodhisatva’s noble truth of the way leading to the cessation of suffering. The kind of realization where one sees the sameness of these four truths, but that is not yet completely purified vision, is what is known as the bodhisatva’s skilled approach to truth.

source: གཞན་ཡང་སྐྱེ་བ་སྡུག་བསྔལ་བ་སྟེ། གང་མི་སྐྱེ་བ་སོ་སོར་རྟོག་པར་ཤེས་པ་དེ་ནི་སྡུག་བསྔལ་ཤེས་པ་ཞེས་བྱའོ། ། སྲིད་པའི་རྐྱེན་གྱིས་སྐྱེ་བ་སྟེ། གང་སྲིད་པ་འཇིག་པར་ཤེས་པ་དེ་ནི་ཀུན་འབྱུང་བ་ཤེས་པ་ཞེས་བྱའོ། ། སྐྱེ་བ་ཐམས་ཅད་གང་གིས་མི་སྐྱེ་བར་ཤེས་ལ་དེ་ལ་འགོག་པ་གང་ཡང་མེད་ཅིང་གང་མི་འགོག་པར་ཤེས་པ་དེ་ནི་ཟད་པ་འགོག་པའི་ཤེས་པ་ཞེས་བྱའོ། ། གང་དེ་ལྟར་ཚོལ་བ་དང་། འཇལ་བ་དང་། ཡོངས་སུ་ཚོལ་བ་དང་། རྣམ་པར་རྟོག་པ་དང་། འཇུག་པའི་ཤེས་པ་དེ་ནི་ལམ་ཤེས་པ་ཞེས་བྱ་སྟེ། གང་བདེན་པའི་ཤེས་པ་དེ་ལ་གཞོག་པར་བྱེད་ཀྱང་བདེན་པའི་ཤེས་པ་དེ་ལ་མི་གནས་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བདེན་པ་ལ་མཁས་པ་སྟེ།
en: “Moreover, birth is suffering, and the examination of nonbirth is what is known as knowledge of suffering. Birth is dependent on becoming, and the knowledge of becoming and destruction is what is known as knowledge of origination. The knowledge that all birth lacks birth and that it has no cessation, the knowledge of noncessation, is what is known as the knowledge of destruction, of cessation. This kind of exploration, reflection, searching, and investigation, of knowing how to engage, is what is known as knowledge of the path. To pursue this knowledge of truth without ending up fixating on the knowledge of truth is what is known as the bodhisatva’s skilled approach to truth.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའི་བདེན་པ་ལ་མཁས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །
en: “This is how the bodhisatva, the great being who is skilled in truth, practices the perfection of wisdom.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སོ་སོ་ཡང་དག་པར་རིག་པ་ལ་མཁས་པ་གང་ཞེ་ན། བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་སོ་སོ་ཡང་དག་པར་རིག་པ་སྟེ། བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དོན་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། ངེས་པའི་ཚིག་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སྤོབས་པ་སོ་སོ་ཡང་དག་པར་རིག་པའོ། །
en: “What kinds of analytical abilities does the bodhisatva have? The bodhisatva has four kinds of analytical abilities. What are these four kinds of analytical abilities? They are analytical ability in relation to objects, analytical ability in relation to phenomena, analytical ability in relation to language, and analytical ability in relation to eloquence.

source: དེ་ལ་དོན་སོ་སོ་ཡང་དག་པར་རིག་པ་གང་ཞེ་ན། གང་ཆོས་རྣམས་ལ་དོན་དམ་པའི་ཚིག་ཏུ་ཤེས་པ་དང་། གཉིས་སུ་མེད་པའི་རྒྱུ་ཤེས་པ་དང་། རྐྱེན་ཤེས་པ་དང་། འདུས་པ་ཤེས་པ་དང་། མཐའ་མེད་པའི་རྗེས་སུ་འགྲོ་བ་ཤེས་པ་དང་། རྟེན་པ་ལ་འཇུག་པ་ཤེས་པ་དང་། ཆོས་ཀྱི་དབྱིངས་དབྱེར་མེད་པར་ཤེས་པ་དང་། དེ་བཞིན་ཉིད་ཀྱིས་རྗེས་སུ་འཇུག་པ་ཤེས་པ་དང་། ཡང་དག་པའི་མཐའ་མི་གནས་པར་ཤེས་པ་དང་། སྟོང་པ་ཉིད་རྗེས་སུ་རྟོགས་པ་ཤེས་པ་དང་།
en: “What is analytical ability in relation to objects? It is knowing how the statements of the ultimate truth relate to phenomena. It is knowledge of the nondual cause. It is knowledge of conditions. It is knowledge of things coming together. It is knowledge that approaches the limitless. It is knowledge that penetrates dependent origination. It is knowledge of the indivisibility of the totality of phenomena. It is knowledge that engages with the way things actually are. It is knowledge that does not remain at the summit of existence. It is knowledge that recollects emptiness.

source: མཚན་མ་མེད་པར་རྟོག་པ་ཤེས་པ་དང་། སྨོན་པ་མེད་པ་ལ་སྨོན་པ་མེད་པར་ཤེས་པ་དང་། མངོན་པར་འདུ་མི་བྱེད་པ་ལ་མངོན་པར་འདུ་མི་བྱེད་པར་ཤེས་པ་དང་། ཚུལ་གཅིག་ཏུ་འཇུག་པ་ཤེས་པ་དང་། སེམས་ཅན་མེད་པར་འཇུག་པ་ཤེས་པ་དང་། བདག་མེད་པར་འཇུག་པ་ཤེས་པ་དང་། སྲོག་མེད་པ་བྱེད་པ་གཅིག་པ་ཤེས་པ་དང་། གང་ཟག་མེད་པ་དོན་དམ་པར་ཤེས་པ་དང་། འདས་པའི་དུས་ལ་མ་ཆགས་པར་ཤེས་པ་དང་། མ་འོངས་པའི་དུས་ལ་མཐའ་མེད་པར་ཤེས་པ་དང་། ད་ལྟར་བྱུང་བའི་དུས་ལ་ཐམས་ཅད་དུ་ཤེས་པ་དང་། ཕུང་པོ་རྣམས་ལ་སྒྱུ་མར་ཤེས་པ་དང་། ཁམས་རྣམས་ལ་སྦྲུལ་གདུག་པ་དང་མཚུངས་པར་ཤེས་པ་དང་། སྐྱེ་མཆེད་རྣམས་ལ་སྟོང་པ་ཉིད་དུ་ངེས་པར་རྟོག་པར་ཤེས་པ་དང་། ནང་ཞི་བ་ཤེས་པ་དང་། ཕྱི་རོལ་ཏུ་མི་རྒྱུ་བ་ཤེས་པ་དང་། ཡུལ་ལ་ཡུལ་མེད་པར་ཤེས་པ་དང་། དྲན་པ་ལ་གནས་སུ་ཤེས་པ་དང་། རྟོགས་པ་ལ་ཁོང་དུ་ཆུད་པར་ཤེས་པ་དང་། བློ་གྲོས་ལ་མངོན་སུམ་དུ་ཤེས་པ་དང་། བདེན་པ་ལ་རབ་ཏུ་རྟོགས་པར་ཤེས་པ་དང་། སྡུག་བསྔལ་ལ་མི་འབྱུང་བར་ཤེས་པ་དང་། ཀུན་འབྱུང་བ་ལ་མངོན་པར་འདུ་མི་བྱེད་པར་ཤེས་པ་དང་། འགོག་པ་ལ་མཚན་ཉིད་མེད་པར་ཤེས་པ་དང་། ལམ་ལ་སྒྲོལ་བར་ཤེས་པ་དང་། ཆོས་ལ་ཚིག་རབ་ཏུ་ཐ་དད་པར་ཤེས་པ་དང་། དབང་པོ་རྣམས་ལ་འཇུག་པར་ཤེས་པ་དང་། སྟོབས་རྣམས་ལ་མི་རྫི་བར་ཤེས་པ་དང་། ཞི་གནས་ལ་གནས་སུ་ཤེས་པ་དང་། ལྷག་མཐོང་ལ་སྣང་བར་ཤེས་པ་དང་། སྒྱུ་མ་ལ་བསྒྲུབ་པར་ཤེས་པ་དང་། སྨིག་རྒྱུ་ལ་འཁྲུལ་པར་ཤེས་པ་དང་། རྨི་ལམ་ལ་མི་བདེན་པ་མཐོང་བར་ཤེས་པ་དང་། བྲག་ཅ་ལ་རྐྱེན་ལ་འཇུག་པར་ཤེས་པ་དང་། མིག་ཡོར་ལ་འཕོ་བར་ཤེས་པ་དང་། མཚན་ཉིད་སྣ་ཚོགས་ལ་མཚན་ཉིད་གཅིག་ཏུ་ཤེས་པ་དང་། འདུ་བ་ལ་འབྲལ་བར་ཤེས་པ་དང་། རབ་ཏུ་སྦྱངས་པ་ལ་ཕྱིར་མཚམས་སྦྱོར་བ་མེད་པར་ཤེས་པ་དང་། ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་སྒྲའི་རྗེས་སུ་འགྲོ་བར་འཇུག་པར་ཤེས་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་རྟེན་པ་ལ་འཇུག་པར་ཤེས་ཤིང་། དབེན་པ་མཆོག་ཏུ་ཤེས་པ་དང་། ཐེག་པ་ཆེན་པོ་ལ་དགེ་བའི་རྩ་བའི་ཚོགས་བསགས་པ་ཐམས་ཅད་ཤེས་པ་སྟེ། དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་དོན་སོ་སོ་ཡང་དག་པར་རིག་པ་ཞེས་བྱའོ། །
en: It is knowledge that considers freedom from attributes. It is knowledge that remains disinterested in goals. It is knowledge that does not construct the unconstructed. It is knowledge that penetrates the one path. It is knowledge that penetrates the fact that there is no being. It is knowledge that penetrates the fact that there is no self. It is knowledge of the single principle of the lack of life force. It is knowledge of the ultimate truth that there is no person. It is knowledge that is not bogged down in the past. It is knowledge that has no limit in the future. It is knowledge that is complete in the present. It is knowledge that relates to the skandhas as illusions. It is knowledge that relates to the elements as being like a poisonous snake. It is knowledge that contemplates the empty nature of the sense fields. It is knowledge where the internal has been pacified. It is knowledge where there is no external wandering. It is knowledge that sees objects and non-objects. It is knowledge that is based on mindfulness. It is knowledge that pursues realization. It is knowledge that is immediately present in the mind. It is knowledge that directly experiences truth. It is knowledge that there is no encounter with suffering. It is knowledge that there is no formation of origination. It is knowledge that there are no essential characteristics of cessation. It is knowledge that there is liberation on the path. It is knowledge of how words are applied to phenomena. It is knowledge that penetrates the faculties. It is knowledge that has powers that are unbreakable. It is knowledge that is settled in calm abiding meditation. It is knowledge that has the clarity of insight meditation. It is knowledge of the delusive nature of illusions. It is knowledge of the confused nature of mirages. It is knowledge of the falsity of appearances in dreams. It is knowledge of how echoes appear based on conditions. It is knowledge of how reflections shift. It is knowledge that sees one characteristic among the many characteristics. It is knowledge that sees meetings as partings. It is knowledge that what has been pacified will not reemerge. It is knowledge of how to follow instructions in the Śrāvakayāna. It is knowledge of how conditions are penetrated, and knowledge of the superiority of seclusion in the Pratyekabuddhayāna. It is knowledge of all the roots of virtue that are accumulated through the Mahāyāna. This is what is known as the bodhisatva’s analytical ability in relation to objects.

source: གཞན་ཡང་དོན་སོ་སོ་ཡང་དག་པར་རིག་པ་ནི་གང་དོན་ལ་རྟོན་པ་སྟེ། ཆོས་ཐམས་ཅད་ཀྱི་ཆོས་ཉིད་ཀུན་གྱི་དོན་ལ་རྟོན་པ་ཉིད་ཀྱི་རྗེས་སུ་འབྲང་བའོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཆོས་ཐམས་ཅད་མ་ལུས་པར་སྟོང་པ་སྟེ། སྟོང་པའི་དོན་གང་ཡིན་པ་དེ་ནི་དོན་ནོ། ། ཆོས་ཐམས་ཅད་མ་ལུས་བར་མཚན་མ་མེད་པ་སྟེ། མཚན་མ་མེད་པའི་དོན་གང་ཡིན་པ་དེ་ནི་དོན་ནོ། ། ཆོས་ཐམས་ཅད་མ་ལུས་པར་སྨོན་པ་མེད་པ་སྟེ། སྨོན་པ་མེད་པའི་དོན་གང་ཡིན་པ་དེ་ནི་དོན་ནོ། ། ཆོས་ཐམས་ཅད་མ་ལུས་པར་རྣམ་པར་ཕྱེ་བ་སྟེ། རྣམ་པར་ཕྱེ་བའི་དོན་གང་ཡིན་པ་དེ་ནི་དོན་ནོ། ། ཆོས་ཐམས་ཅད་མ་ལུས་པར་སེམས་ཅན་མེད། སྲོག་མེད། གང་ཟག་མེད་པ་སྟེ། གང་ཟག་མེད་པའི་དོན་གང་ཡིན་པ་དེ་ནི་དོན་ནོ། ། གང་དེ་ལྟ་བུའི་ཆོས་རྣམས་རྟོགས་པ་དེ་ནི་དོན་སོ་སོ་ཡང་དག་པར་རིག་པ་ཞེས་བྱ་སྟེ། གང་དོན་སྟོན་པ་དེ་ནི་གནས་མེད་པ་སྟོན་པའོ། ། དེ་ནི་མི་ཟད་པ་སྟོན་པའོ། ། སོ་སོ་ཡང་དག་པར་རིག་པ་ནི་རྟོགས་པའི་དོན་སྟོན་པ་ཡིན་ཏེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་གནང་བ། རྗེས་སུ་ཡི་རང་བ། ཡང་དག་པ། དེ་ཁོ་ན། གཞན་མ་ཡིན་པ། ཤེས་རབ་ཀྱིས་ཤིན་ཏུ་རྟོགས་པ། ཐམས་ཅད་དུ་ཁ་ན་མ་ཐོ་བ་མེད་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་དོན་སོ་སོ་ཡང་དག་པར་རིག་པ་ཞེས་བྱའོ། །
en: “Moreover, analytical ability in relation to objects means relying on the meaning. It is to regard the actual nature of all phenomena, and that alone, as the meaning that one should rely on. How is this to be done? All phenomena without exception are empty, and emptiness is the meaning of the object. All phenomena without exception are free from attributes, and being free from attributes is the meaning of the object. All phenomena without exception are free from aspirations, and being free from aspirations is the meaning of the object. All phenomena without exception are dispersed, and being dispersed is the meaning of the object. All phenomena without exception have no being, no life force, and no person, and having no person is the meaning of the object. Realizing that this is what phenomena are like is what is known as analytical ability in relation to objects. To teach this meaning is to teach the impossible. It is to teach the imperishable. Analytical ability points out the meaning that has been realized. It is what the lords, the buddhas, confirm and rejoice in. It is real, essential, and nothing else. It is well founded on wisdom. It is completely irreproachable. This is what is known as the bodhisatva’s analytical ability in relation to objects.

source: དེ་ལ་ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པ་གང་ཞེ་ན། གང་དགེ་བ་དང་། མི་དགེ་བ་དང་། ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་དང་། ཁ་ན་མ་ཐོ་བ་མེད་པ་དང་། ཟག་པ་དང་བཅས་པ་དང་། ཟག་པ་མེད་པ་དང་། འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པ་དང་། འདུས་བྱས་དང་། འདུས་མ་བྱས་དང་། ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བའི་ཆ་དང་འཐུན་པ་དང་། འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པར་ཉེ་བར་འགྲོ་བའི་ཆོས་རྣམས་ལ་འཇུག་པར་ཤེས་པ་དང་། ཆོས་ཀྱི་དབྱིངས་མཉམ་པ་ཉིད་ཤེས་པ་དང་། བྱང་ཆུབ་མཉམ་པ་ཉིད་ཤེས་པ་དང་། ཁམས་མཉམ་པ་ཉིད་ཤེས་པ་སྟེ། དེ་ནི་ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པ་ཞེས་བྱའོ། །
en: “What is analytical ability in relation to phenomena? It is the knowledge of how to relate to mental objects. With respect to the wholesome and the unwholesome, the reproachable and the irreproachable, the defiled and the undefiled, the worldly and the transcendent, the conditioned and the unconditioned, the corrupt and that which is conducive to purification, and cyclic existence and nirvāṇa, it is the knowledge that sees these as the same from the perspective of the totality of phenomena, it is the knowledge of sameness from the perspective of awakening, and it is the knowledge of sameness inherent in the elements. This is what is known as analytical ability in relation to phenomena.

source: གཞན་ཡང་ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པ་ནི་གང་འདོད་ཆགས་སྤྱོད་པ་རྣམས་ལ་སེམས་འཇུག་པ་ཤེས་པ་དང་། བཅོས་པའི་འདོད་ཆགས་སྤྱོད་པ་རྣམས་དང་། འདོད་ཆགས་བརྟན་པར་སྤྱོད་པ་རྣམས་དང་། འདོད་ཆགས་ཆུང་ངུ་སྤྱོད་པ་རྣམས་དང་། རྣམ་པར་མི་ལྡང་བའི་འདོད་ཆགས་སྤྱོད་པ་རྣམས་དང་། མཐའ་མ་རྟག་ཏུ་མེད་པའི་འདོད་ཆགས་སྤྱོད་པ་རྣམས་དང་། ད་ལྟར་བྱུང་བ་ལ་རྐྱེན་གྱིས་འདོད་ཆགས་སྤྱོད་པ་རྣམས་ལ་འཇུག་པ་སྟེ། སེམས་ཅན་གང་དག་ནང་དུ་འདོད་ཆགས་ལ་ཕྱི་རོལ་ཏུ་འདོད་ཆགས་མེད་པ་དང་། ཕྱི་རོལ་ཏུ་འདོད་ཆགས་ལ་ནང་དུ་འདོད་ཆགས་མེད་པ་དང་། ནང་དུའང་འདོད་ཆགས་མེད། ཕྱི་རོལ་ཏུའང་འདོད་ཆགས་མེད་པ་དང་། ནང་དང་ཕྱི་རོལ་ཏུ་འདོད་ཆགས་པ་དང་། གཟུགས་ལ་འདོད་ཆགས་ལ་སྒྲ་ལ་འདོད་ཆགས་མེད་པ་དང་། སྒྲ་ལ་འདོད་ཆགས་ལ་གཟུགས་ལ་འདོད་ཆགས་མེད་པ་དང་། གཟུགས་དང་སྒྲ་ལ་འདོད་ཆགས་པ་དང་། གཟུགས་དང་སྒྲ་ལ་འདོད་ཆགས་མེད་པ་དང་། དྲི་ལ་འདོད་ཆགས་མེད་པ་དང་། དྲི་ལ་འདོད་ཆགས་ལ་རེག་ལ་འདོད་ཆགས་མེད་པ་དང་། རེག་ལ་འདོད་ཆགས་ལ་རོ་ལ་འདོད་ཆགས་མེད་པ་དང་། རོ་ལ་འདོད་ཆགས་ལ་གཟུགས་ལ་འདོད་ཆགས་མེད་པ་དང་། གཟུགས་ལ་འདོད་ཆགས་ལ་དྲི་ལ་འདོད་ཆགས་མེད་པ་དེ་ནི་འདོད་ཆགས་སྤྱོད་པ་རྣམས་ཀྱི་འཇུག་པ་སྟེ། འཇུག་པ་དེའི་སྒོས་འདོད་ཆགས་སྤྱོད་པ་རྣམས་ལ་ཉི་ཁྲི་ཆིག་སྟོང་། ཞེ་སྡང་སྤྱོད་པ་རྣམས་ལ་ཉི་ཁྲི་ཆིག་སྟོང་། གཏི་མུག་སྤྱོད་པ་རྣམས་ལ་ཉི་ཁྲི་ཆིག་སྟོང་། ཆ་མཉམ་པར་སྤྱོད་པ་རྣམས་ལ་ཉི་ཁྲི་ཆིག་སྟོང་སྟེ། གང་དེ་དག་གི་སྤྱོད་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་གི་སེམས་འཇུག་པར་ཤེས་པ་དང་། ཇི་ལྟར་རིགས་པ་བསྟན་པ་ཤེས་པ་དང་། མི་མང་མི་ཉུང་བར་བསྟན་པ་ཤེས་པ་དང་། འདོད་པ་ལས་ཡང་དག་པར་འདའ་བར་ཤེས་པ་དང་། སྣོད་ཀྱི་ཁྱད་པར་ཤེས་པ་དང་། འབྲས་བུ་ཡོད་པར་བསྟན་པ་ཤེས་པ་དེ་ནི་ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པ་ཞེས་བྱའོ། །
en: “Furthermore, analytical ability in relation to phenomena is the knowledge that is able to relate to a mind that is acting out of desire. It can relate to acts of constructed desire, acts of strong desire, acts of weak desire, acts of unyielding desire, acts of desire in the past, acts of desire that seem to have no end, and acts of desire that arise due to conditions in the present. It can relate to the acts of desire of sentient beings whose desire is directed inward and who have no desire directed outward, those whose desire is directed outward and who have no desire directed inward, those who have no desire directed inward and have no desire directed outward, those who have desire directed both inward and outward, those who have desire for form but no desire for sound, those who have desire for sound but no desire for form, those who have desire for neither sound nor form, those who have desire for both sound and form, those who have no desire for smell, those who have desire for smell but no desire for touch, those who have desire for touch but no desire for taste, those who have desire for taste but no desire for form, and those who have desire for form but no desire for smell. In this way, then, there are twenty-one thousand ways of relating to acts of desire, twenty-one thousand ways of relating to acts of anger, twenty-one thousand ways of relating to acts of confusion, and twenty-one thousand ways of relating to acts that are a combination of these. This knowledge is a knowledge that can relate to the mind that acts in these eighty-four thousand different ways. It is the knowledge that can steer one onto the right course. It is the knowledge of how to teach neither too much nor too little. It is the knowledge that goes beyond passion. It is the knowledge that can identify the kind of person one is teaching. It is the knowledge of how to teach in circumstances where it will not go to waste. This is what is known as analytical ability in relation to phenomena.

source: དེ་ལ་ངེས་པའི་ཚིག་སོ་སོ་ཡང་དག་པར་རིག་པ་གང་ཞེ་ན། གང་སྐད་ཐམས་ཅད་ལ་སྐད་མེད་པར་འཇུག་པར་ཤེས་པ་དང་། ལྷའི་སྐད་དང་། ཀླུའི་སྐད་དང་། གནོད་སྦྱིན་གྱི་སྐད་དང་། དྲི་ཟའི་སྐད་དང་མིའམ་ཅིའི་སྐད་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་སྐད་དང་། མི་དང་མི་མ་ཡིན་པའི་སྐད་དང་། འགྲོ་བ་ལྔར་སྐྱེས་པའི་སེམས་ཅན་རྣམས་ཀྱི་སྐད་དང་། སྒྲ་དང་དབྱངས་རྣམས་ལས་སྐད་དེས་དེ་དག་ལ་ཆོས་འཆད་པ་སྟེ། དེ་ནི་ངེས་པའི་ཚིག་སོ་སོ་ཡང་དག་པར་རིག་པ་ཞེས་བྱ་སྟེ། དེ་ལྟར་ཆོས་དེ་དག་བརྟག་པར་བྱའོ། །
en: “What is analytical ability in relation to language? It is the knowledge that relates to all language as non-language. It is the ability to teach the Dharma in the kind of language that is appropriate for sentient beings who have been born into the five states of existence—the language of gods, the language of nāgas, the language of yakṣas, the language of gandharvas, the language of kinnaras, the language of mahoragas, the language of human beings, or the language of nonhuman beings. This is what is meant by analytical ability in relation to language.

source: དེ་ལྟར་ཆོས་དེ་དག་བསྡུ་བར་བྱའོ། ། དེ་ལྟར་ཆོས་དེ་དག་རྗེས་སུ་རྒྱུན་ཆགས་པར་བྱའོ། ། དེ་ལྟར་ཆོས་དེ་དག་ཡི་གེ་རྣམས་ཀྱིས་སྦྲེལ་བར་བྱའོ། །
en: “Teachings must be structured in a suitable way. Teachings must make connections in a suitable way. Teachings must be committed to writing using suitable letters.

source: དེ་ཚིག་གཅིག་གི་བླ་དགས་ཤེས། ཚིག་གཉིས་པའི་བླ་དགས་ཤེས། ཚིག་མང་པོའི་བླ་དགས་ཤེས། བུད་མེད་ཀྱི་ཚིག་ཤེས། སྐྱེས་པའི་ཚིག་ཤེས། མ་ནིང་གི་ཚིག་ཤེས། བསྡུས་པའི་ཚིག་ཤེས། རྒྱས་པའི་ཚིག་ཤེས། སྨད་པའི་ཚིག་ཤེས། བསྟོད་པའི་ཚིག་ཤེས། འདས་པའི་ཚིག་ཤེས། མ་འོངས་པའི་ཚིག་ཤེས། ད་ལྟར་བྱུང་བའི་ཚིག་ཤེས། ཡི་གེ་གཅིག་གིས་སྒྲོ་བཏགས་པ་ཤེས། ཡི་གེ་མང་པོས་སྒྲོ་བཏགས་པ་ཤེས་ཏེ། དེ་ནི་ངེས་པའི་ཚིག་སོ་སོ་ཡང་དག་པར་རིག་པ་ཞེས་བྱའོ། །
en: “Analytical ability in relation to language is to know the singular form of the word, to know the dual form of the word, and to know the plural form of the word. It is to know the feminine words, to know the masculine words, and to know the neuter words. It is to know concise expressions, to know elaborate expressions, and to know colloquial expressions. It is to know the past tense of the word, to know the future tense of the word, and to know the present tense of the word. It is to know what is implied by one syllable, and what is implied by many syllables. This is what is meant by analytical ability in relation to language.

source: ཡང་དེའི་ངེས་པའི་ཚིག་སོ་སོ་ཡང་དག་པར་རིག་པ་ནི་འཁྲུལ་པ་མ་ཡིན། ཟློས་པ་མ་ཡིན། བརྟགས་པ་མ་ཡིན། དོན་གསལ་བའི་ཡི་གེ་ཡོངས་སུ་བྱང་བ་སྟེ། ཅི་ནས་ཀྱང་འཁོར་ཡང་དག་པར་དགའ་བ། སྣ་ཚོགས་པ། ཟབ་པ། ཟབ་པར་སྣང་བ། ཀུན་རྫོབ་དང་། དོན་དམ་པས་བརྒྱན་པ། བདག་གིས་སེམས་མཐོང་བའི་ཤེས་པ་ལ་རག་ལུས་པ། སངས་རྒྱས་ཀྱིས་གནང་བ། སེམས་ཅན་ཐམས་ཅད་དགའ་བར་བྱེད་པ་སྟེ། དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ངེས་པའི་ཚིག་སོ་སོ་ཡང་དག་པར་རིག་པ་ཞེས་བྱའོ། །
en: “Moreover, analytical ability in relation to language is such that there are no mistakes, there is no repetition, and there is no haste. There is clarity. It yields expressions that help clarify the meaning of things. It is language that will please any assembly. It is varied and profound, and it reveals profound meaning. It is adorned with both the relative and the ultimate truth. It is based on the knowledge of what one sees with one’s own mind. It is confirmed by the buddhas. It delights all sentient beings. This is what is known as analytical ability in relation to language.
